cfg/Documents/КадровоеПеремещениеОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>КадровоеПеремещениеОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<BasedOn>
				<xr:Item>Catalog.СотрудникиОрганизаций</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗанятыеШтатныеЕдиницыОрганизаций</xr:Item>
				<xr:Item>InformationRegister.УдалитьНамеченныеСобытияПоПерсоналуОрганизаций</xr:Item>
				<xr:Item>InformationRegister.НамеченныеСобытияПоПерсоналу</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисленияРаботниковОрганизаций</xr:Item>
				<xr:Item>InformationRegister.РаботникиОрганизаций</xr:Item>
				<xr:Item>InformationRegister.КоэффициентыПовышенияОкладов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовышениеОкладов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКоэффициентИндексацииЗаработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПроизошедшееСобытие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗанимаемыхСтавок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьТабельныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаОплатыТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеПеремещения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НапомнитьПоЗавершении</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПринятНаНовоеРабочееМесто</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсновныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта6</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд6</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьДополнительныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.УдалитьДополнительныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/Enums/ВидыДействияСНачислением.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДействияСНачислением</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начать</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменить</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИзменять</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прекратить</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Documents/КадровоеПеремещениеОрганизаций/Forms/ФормаГрупповаяОбработка/Ext/Form/Module.bsl
Процедура ПриОткрытии()
	
	ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням;
	
	мСведенияОВидахРасчетаОснНачислений = Новый Соответствие;
	СведенияОВидеРасчета = РаботаСДиалогами.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчетаОснНачислений, ВидРасчета);

	Для СчПоказателей = 1 По Мин(СведенияОВидеРасчета["КоличествоПоказателей"],6) Цикл
		Если СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"] Тогда
			НС = Показатели.Добавить();
			НС.Номер = СчПоказателей;
			НС.Показатель = СведенияОВидеРасчета["Показатель"+счПоказателей+"Наименование"];
			НС.Действие = НСтр("ru='Установить значение';uk='Встановити значення'");
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Процедура ОсновныеДействияФормыВыполнить(Кнопка)
	
	Если Действие = "Добавить" Тогда
		Для Каждого Сотрудник из Работники Цикл
			СтруктураПоиска = Новый Структура("Сотрудник,ВидРасчета", Сотрудник.Сотрудник,ВидРасчета);
			НайденныеСтроки = Документ.ОсновныеНачисления.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НС = Документ.ОсновныеНачисления.Добавить();
				НС.Сотрудник = Сотрудник.Сотрудник;
				НС.ВидРасчета = ВидРасчета;
				НС.Действие = Перечисления.ВидыДействияСНачислением.Начать;
				Для Каждого Показатель из Показатели Цикл
					НС["Показатель"+Показатель.Номер] = Показатель.Значение;
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;
		Документ.ОсновныеНачисления.Сортировать("Сотрудник");
	ИначеЕсли Действие = "Изменить" Тогда
		Для Каждого СтрокаТЧ из Документ.ОсновныеНачисления Цикл
			Если СтрокаТЧ.ВидРасчета <> ВидРасчета Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого Показатель из Показатели Цикл
				Если Показатель.Действие = НСтр("ru='Установить значение';uk='Встановити значення'") Тогда
					СтрокаТЧ["Показатель"+Показатель.Номер] = Показатель.Значение;
				ИначеЕсли Показатель.Действие = НСтр("ru='Изменить (суммой)';uk='Змінити (сумою)'") Тогда
					СтрокаТЧ["Показатель"+Показатель.Номер] = СтрокаТЧ["Показатель"+Показатель.Номер]+Показатель.Значение;	
				ИначеЕсли Показатель.Действие = НСтр("ru='Изменить (процентом)';uk='Змінити (відсотком)'") Тогда
					СтрокаТЧ["Показатель"+Показатель.Номер] = СтрокаТЧ["Показатель"+Показатель.Номер]+СтрокаТЧ["Показатель"+Показатель.Номер]*Показатель.Значение/100;	
				КонецЕсли;	
			КонецЦикла;
			СтрокаТЧ.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
		КонецЦикла;
		
	ИначеЕсли Действие = "Удалить" Тогда
		Для Каждого СтрокаТЧ из Документ.ОсновныеНачисления Цикл
			Если СтрокаТЧ.ВидРасчета <> ВидРасчета Тогда
				Продолжить;
			КонецЕсли;
			СтрокаТЧ.Действие = Перечисления.ВидыДействияСНачислением.Прекратить;
		КонецЦикла;
		
	КонецЕсли;	
	Закрыть();
	
КонецПроцедуры

Процедура ВидРасчетаПриИзменении(Элемент)
	
	Показатели.Очистить();
	
	Если Действие = "Удалить" Тогда
		Возврат;
	КонецЕсли;	
	
	мСведенияОВидахРасчетаОснНачислений = Новый Соответствие;
	СведенияОВидеРасчета = РаботаСДиалогами.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчетаОснНачислений, ВидРасчета);

	Для СчПоказателей = 1 По Мин(СведенияОВидеРасчета["КоличествоПоказателей"],6) Цикл
		Если СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"] Тогда
			НС = Показатели.Добавить();
			НС.Номер = СчПоказателей;
			НС.Показатель = СведенияОВидеРасчета["Показатель"+счПоказателей+"Наименование"];
			НС.Действие = НСтр("ru='Установить значение';uk='Встановити значення'");
		КонецЕсли;	
	КонецЦикла;	
	
	
	
КонецПроцедуры

Процедура ДействиеПриИзменении(Элемент)
	
	Если Действие = "Удалить" Тогда
		Показатели.Очистить();
	ИначеЕсли Действие = "Добавить" Тогда
		Элементыформы.Показатели.Колонки.Действие.Видимость = Ложь;
	Иначе
		Элементыформы.Показатели.Колонки.Действие.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПоказателиДействиеПриИзменении(Элемент)
	
	Если Элементыформы.Показатели.ТекущиеДанные.Действие = НСтр("ru='Не изменять';uk='Не змінювати'") Тогда
		 Элементыформы.Показатели.ТекущиеДанные.Значение = 0;
	КонецЕсли;	 
	
КонецПроцедуры
